Revit 2027 API
CircuitNamingScheme.GetCombinedParameters Method
 Gets the combined parameters.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<TableCellCombinedParameterData> GetCombinedParameters()
Public Function GetCombinedParameters As IList(Of TableCellCombinedParameterData)
public:
IList<TableCellCombinedParameterData^>^ GetCombinedParameters()
member GetCombinedParameters : unit -> IList<TableCellCombinedParameterData>
Return Value
IList<TableCellCombinedParameterData>
 Gets array of TableCellCombinedParameterData with the combined parameters data.
See Also
Reference
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace